Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: ཟས་འདོད་པ་ལ་ཟས་བྱིན། སྐོམ་འདོད་པ་ལ་སྐོམ་བྱིན། བཞོན་པ་དང་། གོས་དང་། མེ་ཏོག་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་རིན་པོ་ཆེའི་རྒྱན་དང་། ཡོ་བྱད་ཐམས་ཅད་དང་། ལྷབ་ལྷུབ་ཐམས་ཅད་དང་། ཡོ་བྱད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱང་དེ་དག་འདོད་པ་ལ་ཡོངས་སུ་བཏང་སྟེ།
en: He gave food to those who wanted food, gave drink to those who wanted drink, and likewise gave steeds, clothes, flowers, powders, ointments, Dharma robes, parasols, banners, flags, precious jewelry, all ornaments, and every kind of necessity that was wished for.

source: དེ་ནས་ཉི་མ་ཐ་མ་ལ་བབ་པར་གྱུར་བ་དང་། འགྲོ་བ་མང་པོའི་ཚོགས་ཀུན་ནས་འདུས་ཏེ།
en: “When the last day arrived, an assembly of many beings gathered.

source: རྒྱལ་པོའི་བློན་པོ་དང་། བུད་མྱེད་ཀྱི་ཚོགས་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། ལྗོངས་དང་། ཡུལ་གྱི་མྱི་དང་། ཞགས་པ་འཐུབ་པ་ཐམས་ཅད་ཀྱང་ཀུན་ནས་འདུས།
en: The king’s ministers, the group of queens, the head merchants, the householders, the people of the land, and the Jains assembled.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་ཡང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་ཐུགས་སུ་ཆུད་ནས། མཆོད་སྦྱིན་གྱི་གནས་དེར་གཤེགས་ཏེ།
en: “The Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, knowing it was the time to guide and ripen beings, also went to the site of the distribution of gifts.

source: ལྷའི་དབང་པོའི་ཚོགས་ཀྱིས་ནི་ཡོངས་སུ་བསྐོར།
en: A gathering of lords of the devas was his entourage;

source: ཀླུའི་དབང་པོས་ནི་ཡང་དག་པར་མཆོད།
en: lords of the nāgas made offerings to him;

source: གནོད་སྦྱིན་གྱི་དབང་པོས་ནི་ལུས་མངོན་པར་བཏུད།
en: lords of the yakṣas were bowing to him;

source: དྲི་ཟའི་དབང་པོས་ནི་མངོན་པར་བསྟོད།
en: lords of the gandharvas were praising him; lords of the asuras were bowing down to him;

source: ལྷ་མ་ཡིན་གྱི་དབང་པོས་ནི་ལུས་ཤིན་ཏུ་བཏུད་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་གཙུག་གི་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པས་ནི་སེམས་དང་བའི་མཆོད་པའི་རྣམ་པས་རབ་ཏུ་བཀང་།
en: lords of the garuḍas, who were adorned by crest jewels, were with delight strewing offerings;

source: མྱིའམ་ཅིའི་དབང་པོ་རྣམས་ཀྱིས་ནི་དགའ་བའི་ཡིད་ཀྱིས་ཡོངས་སུ་མཆོད་དེ། བསྟོད་པའི་གླུའི་དབྱངས་ཀྱིས་ཡོངས་སུ་བསྐུལ།
en: lords of the kinnaras made offerings with joy and sang inspirational songs of praise;

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་རྣམས་ཀྱིས་ནི་ཀུན་ནས་བསྐོར་ཅིང་ཞལ་དུ་བལྟ་བ་དེ།
en: and lords of the mahoragas encircled him, gazing at his face.

source: འགྲོ་བའི་ཚོགས་ཆེན་པོ་དེ་དང་། རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་ཤིན་ཏུ་མཛེས་པ་བལྟ་ན་སྡུག་པ། དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ། ཤིན་ཏུ་དབེན་པར་དབང་པོ་ལས་རྒྱལ་བ། གླང་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ། མཚོ་ལྟར་རབ་ཏུ་དང་ཞིང་གསལ་ལ་རྙོག་པ་མྱེད་པ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་དང་། ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཆེན་པོས་ནི་རྣམ་པར་མཛེས།
en: “That great gathering of beings and Prince Vijitāvin saw, approaching from afar, the Bhagavat, the Tathāgata Arhat Samyak­saṃbuddha Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, who was handsome and delightful to look at, with pacified senses and a pacified mind, withdrawn, victorious over the senses, as tame as an elephant, as pure, clear, and unpolluted as a lake, beautified by buddhahood’s emanations and great miraculous manifestations and by the powerful supremacy of buddhahood, and shining with the greatness of buddhahood.

source: སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བས་ནི་རབ་ཏུ་འབར། སངས་རྒྱས་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་རྒྱན་གྱིས་ནི་སྐུ་མཛེས་པར་བརྒྱན། འཇིག་རྟེན་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་སྣང་བས་རྒྱས་པར་འགེངས་ཤིང་། སངས་རྒྱས་ཀྱི་འོད་ཟེར་གྱིས་རབ་ཏུ་སྣང་བ་མཛད། སྐུའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནི། སྤོས་རིན་པོ་ཆེའི་ངད་འཕྲོ་བའི་འཁོར་ལོ་རབ་ཏུ་འགྱེད།
en: His body was beautifully adorned by the adornments of the physical signs and features of a buddha, and he was filling all worlds with the illumination of a buddha’s halo of light, illuminating with a buddha’s light rays, emanating a field of the spreading aroma of precious perfumes from all his body’s pores, and shaking all world realms in the manner of shaking buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་བསྐྱོད་པའི་ཚུལ་དུ་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་པ་མཛད་ཅིང་། རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པའི་སངས་རྒྱས་ཀྱི་རྣམ་པར་གནོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བའི་སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་མཛད་པའི་སངས་རྒྱས་ཀྱི་ཞལ་བལྟ་བའི་བྱིན་གྱིས། ཕ་ཟད་ཅིག་ནས་ཚུར་གཤེགས་པ་མཐོང་ནས།
en: He was approaching while sending down a rain from a cloud of all adornments, with the prowess of buddhahood, with the conduct of buddhahood that eliminates kleśas within all beings, and through the sight of the buddha’s face increasing the power of joy in all beings, who on seeing the tathāgata gained faith in their minds in the tathāgata.

source: དེ་བཞིན་གཤེགས་པ་ལ་སེམས་མངོན་པར་མོས་པར་གྱུར་ཏོ། །དེ་ནས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་དང་། འགྲོ་བའི་ཚོགས་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་དེ། ཕ་ཟད་དུ་བསུ་ནས་མོས་པའི་སེམས་ཀྱིས་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ་ཕྱག་འཚལ་ནས། ཞབས་གཉིས་ལ་སྤྱི་བོས་གཏུགས་ཏེ།
en: “Then Prince Vijitāvin and the great gathering of beings went to greet in the distance the Bhagavat Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, and with faith in him they prostrated with their whole bodies, touching the tops of their heads to his feet.

source: མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པར་མཆོད་ནས་ཚིག་འདི་སྐད་དུ་བརྗོད་དོ། །བཅོམ་ལྡན་འདས་ཚུར་གཤེགས་སུ་གསོལ།
en: They offered various kinds of offerings to him and said, ‘Come, Bhagavat!

source: བདེ་བར་གཤེགས་པ་ཚུར་གཤེགས་སུ་གསོལ།
en: Come, Sugata!

source: དེ་བཞིན་གཤེགས་པས་བདག་ཅག་དགོངས་སོ།
en: Tathāgata, pay heed to us!

source: །བདེ་བར་གཤེགས་པས་བདག་ཅག་ཡོངས་སུ་བཟུང་ངོ་།
en: Tathāgata, take us into your care!’

source: །དེ་ནས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བཅོམ་ལྡན་འདས་ལ་གདན་དམ་པས་བསྟབས་ཏེ།
en: “Then Prince Vijitāvin prepared an excellent seat for the Bhagavat and said to him, ‘Bhagavat, I request that you be seated upon this seat that has been arranged for you.’

source: འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གདན་བཏིང་བ་འདིར་བཞུགས་སུ་གསོལ་ཞེས་ནས་བཅོམ་ལྡན་འདས་དེར་གཤེགས་པ་དང་གདན་དེ་ཡང་གཙང་སྦྲ་ལྷུར་ལེན་པའི་ལུས་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་རིན་པོ་ཆེ་སྤོས་ཀྱི་རྒྱལ་པོའི་པདྨོའི་སྙིང་པོ་ཅན་དུ་བྱིན་གྱིས་བརླབས་ནས།
en: “The Bhagavat approached it, and, through the blessing of the buddha, the types of devas who were devoted to cleanliness of the body transformed the seat so that it had in its center a lotus of the king of precious perfumes.

source: གདན་དེ་ལ་བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་བཞུགས་སོ། །འཁོར་གྱི་སྟན་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཁོད་དེ།
en: “The Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, sat upon that seat, and bodhisattvas sat upon the surrounding seats.

source: དེའི་ཞལ་མཐོང་མ་ཐག་ཏུ་འཁོར་དེའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་། སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་ཏེ།
en: The beings of that assembly, as soon as they saw his face, became freed from all obscurations;

source: ནད་ཐམས་ཅད་ཀྱང་ཞི་བར་གྱུར་ནས། འཕགས་པའི་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་ཏོ།
en: all their illnesses ceased, and they became vessels for the Dharma of the āryas.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་བོས་སེམས་ཅན་དེ་དག་སྣོད་དུ་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས། བསྟན་པ་རིམ་པས་བཀའ་སྩལ་ཏེ།
en: “Then the Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, knowing that those beings had become ready vessels, gave the teachings in stages.

source: འདི་ལྟར་རྒྱུའི་དཀྱིལ་འཁོར་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་བསྟན་ནས་ཞལ་གྱི་སྒོ་ནས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་རྒྱ་མཚོ་དང་། ངེས་པའི་ཚིག་དང་། ངག་གིས་དབྱངས་སུ་བརྗོད་པའི་གསུང་དབྱངས་ཀྱི་ཡན་ལག་སྟོང་དང་ལྡན་པ།
en: He taught the sūtra called The Illumination of the Field of Causes . He spoke through the entire ocean of the languages of beings, definitions, and sounds of the voice, speaking with the thousands of aspects of speech and possessing the thousands of aspects of the Dharma.

source: ཆོས་ཀྱི་ཡན་ལག་ཐམས་ཅད་དང་ལྡན་པ་རབ་ཏུ་བསྒྲགས་པ་དང་། དེའི་མོད་ལ་འཁོར་དེ་ནས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ནི་རྡུལ་དང་བྲལ་ཏེ། དྲི་མ་མྱེད་པར་གྱུར་ནས། ཆོས་ལ་ཆོས་ཀྱི་མྱིག་སྐྱེས་པར་གྱུར་ཏོ།
en: “At that moment, eight hundred million beings within that assembly became free of impurities, became stainless, and developed the Dharma vision of the Dharma;

source: །སྲོག་ཆགས་བྱེ་བ་མང་ཞིག་གིས་ནི། མྱི་སློབ་པའི་ས་ཐོབ་པར་གྱུར་ཏོ།
en: many millions of beings attained the state beyond training;

source: །སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་ནི་ཐེག་པ་ཆེན་པོ་ལ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ།
en: and ten thousand beings were guided into the Mahāyāna.

source: །འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོ་དང་། སྨོན་ལམ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པའི་ཚུལ་ལ་ཞུགས་པར་གྱུར་ཏོ།
en: Thus they entered into the way of completely good bodhisattva conduct and accomplished great prayers.

source: །དེ་ལྟར་བཅོམ་ལྡན་འདས་དེས་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཚེ། ཕྱོགས་བཅུའི་སེམས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཐེག་པ་ཆེན་པོ་ལ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ།
en: “When the Bhagavat this time turned the wheel of the Dharma through the great miraculous powers of buddhahood, beings in the ten directions, as numerous as the atoms in a hundred thousand buddha realms, were guided into the Mahāyāna;

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་སྣ་ཚོགས་སུ་གཏོགས་པའི་སེམས་ཅན་མཐའ་དང་དབུས་མྱེད་པ་དག་གི་ཡང་ངན་སོང་གི་ས་རྣམ་པར་བཟློག་པར་གྱུར་ཏོ། །སེམས་ཅན་གྲངས་ལས་འདས་པ་ཞིག་ནི་མཐོ་རིས་སུ་སྐྱེ་བའི་ལམ་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ།
en: beings without end or middle throughout the extent of the various worlds and buddha realms were turned away from the lower existences, and beings beyond number were brought onto the path to rebirth in the higher existences.

source: །རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཐོབ་པར་གྱུར་ཏོ།
en: “Prince Vijitāvin also attained this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings

source: །རིགས་ཀྱི་བུ་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་བྱུང་སྟེ། རང་གི་ལུས་དང་སྲོག་ཡོངས་སུ་བཏང་ནས། ནོར་གྱི་ཚོགས་དང་། འཁོར་ཐམས་ཅད་དང་། མྱིའི་འཇིག་རྟེན་ན་འཚོ་བའི་བདེ་བ་ཡོངས་སུ་སྤངས་ནས་བཙོན་ར་ན་འཁོང་པའི་སེམས་ཅན་དེ་དག་ཐར་བར་བྱས་པ། མཆོད་སྦྱིན་ཆེན་པོ་གཏན་པ་མྱེད་པའི་མཆོད་སྦྱིན་བྱེད་བྱེད་པ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་དེ་ལ་བསྙེན་བཀུར་བྱེད་བྱེད་པ་དེ་བཞིན་གཤེགས་པ་དེའི་ཞལ་མཐོང་བའི་མོད་ལ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡང་ཐོབ་པར་གྱུར་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: “Noble one, at that time, in that time, there was the prince named Vijitāvin who gave up his own body and life, his accumulation of wealth, his entire entourage, and the happiness of living in the human world and freed those beings who were in prison, made an unrestricted great distribution of gifts and offerings, honored the Bhagavat, the Tathāgata Arhat Samyak­saṃbuddha Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, and, when he saw the face of that tathāgata, developed the aspiration for the highest complete enlightenment and attained this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think he was anyone else, noble one, do not see him in that way.

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེ་ལྟར་ཁོ་མོ་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: At that time, in that time, I was the prince named Vijitāvin. In that way, I was the prince named Vijitāvin, who became saddened because of great compassion and who engaged in benefiting all beings without any hope of not remaining in the three realms or of having a karmic result in return;

source: སྙིང་རྗེ་ཆེན་པོས་རབ་ཏུ་མྱི་དགའ་ཞིང་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པར་ཞུགས་ཏེ།
en: without any delight in fame, renown, or a great name; without praise for oneself; without criticizing others; without attachment to anything; having risen above the perceptions of existence;

source: ཁམས་གསུམ་ལ་མྱི་གནས་པ་དང་། རྣམ་པར་སྨྱིན་པའི་ལན་ལ་རེ་བ་མྱེད་པ་དང་། གྲགས་པ་དང་སྙན་པ་དང་། མྱིང་སྨོས་པ་ལ་མངོན་པར་དགའ་བ་མྱེད་པ་དང་། བདག་ལ་བསྟོད་པ་མྱེད་པ་དང་། གཞན་ལ་སྨོད་པ་མྱེད་པ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མྱེད་པ་དང་། སྲིད་པའི་འདུ་ཤེས་ལས་གྱེན་དུ་འཕགས་པ་དང་། ཁམས་གསུམ་པ་ལ་མངོན་པར་དགའ་བ་མྱེད་པ་དང་། འཇིག་རྟེན་གྱི་ཡུལ་གྱི་བདེ་བ་ལས་ཕྱིར་ཕྱོགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་མངོན་ཏུ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་རྣམ་པར་དག་པ་དང་། ལྷག་པའི་བསམ་པ་རྡོ་རྗེ་ཡོངས་སུ་གྲུབ་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོས་ནན་ཏན་དུ་བྱེད་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བས་སྡུག་བསྔལ་རྣམ་པར་ཞི་བར་བྱ་བ་ལ་བརྩོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་ལ་བསམ་པ་ཐག་པ་ནས་ལྷག་པར་དམྱིགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་སྦྱང་བ་དང་། ཐེག་པ་ཆེན་པོའི་རྒྱན་གྱིས་འབྱུང་བའི་ལམ་རབ་ཏུ་བརྒྱན་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྒོམ་མངོན་པར་བལྟ་བར་བྱ་བའི་ཚུལ་གྱིས་དེ་དག་དེ་ལྟ་བུར་དགའ་བ་དག་ཀྱང་བྱས་པར་གྱུར་ཏོ།
en: without delighting in the three realms; while turning away from the pleasures of the sensory field of the world, perceiving the field of the tathāgatas, having the pure motivation of the bodhisattvas, having created the thunderbolt of the superior motivation, and dedicated with great love to all beings; through compassion for all beings undertaking the ending of suffering; with a sincere focus on the strengths of the tathāgatas; and while training in the path of the bodhisattvas, adorning the path that brings forth the displays of the Mahāyāna, and gazing upon the gateway into omniscience, in that way accomplishing actions that are difficult to do.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཡུན་དེ་སྲིད་དུ་རིང་བ་ཞིག་ནས་ཐོབ་པར་གྱུར་ཏོ།
en: “Noble one, that is how long it has been since I attained this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ལ་ལོག་པར་གསོལ་བ་འདེབས་ཤིང་ཁོ་མོ་བསད་པའི་ཕྱིར་གྲོས་སུ་གསོལ་བའི་བློན་པོ་ལྔ་བརྒྱ་པོ་རྣམས་གཞན་དག་གཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that anyone else was at that time, in that time, the five hundred ministers who made a perverse request to King Jayaprabha and gave their counsel so that I would be executed, do not see them in that way.

source: ལྷས་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་དགྲོངས་པའི་ཕྱིར་སྐྱེས་བུ་ལྔ་བརྒྱ་བཀྱེ་བ་དེ་དག་ཡིན་ཏེ།
en: They were the five hundred men sent by Devadatta to assassinate the Bhagavat.

source: དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་མ་འོངས་པའི་དུས་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ན་བསྐལ་པ་འོད་བཟང་པོ་ཞེས་བྱ་བ་གཅིག་ལ་སངས་རྒྱས་ལྔ་བརྒྱ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་དང་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ།
en: “The Bhagavat has prophesied that they too will attain the highest, complete enlightenment in a future time, after as many kalpas as there are atoms in Sumeru , in a kalpa called Suprabha , as five hundred buddhas with various qualities and displays of a buddha realm, born into various clans and castes;

source: རིགས་དང་རྒྱུད་སྣ་ཚོགས་སུ་སྐྱེས་པ།
en: with mothers and fathers with various names;

source: ཕ་དང་མ་སྣ་ཚོགས་སུ་སྨོས་པ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་བ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་མངོན་པར་འབྱུང་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: manifesting various miraculous births; with various miraculous settings forth into homelessness;

source: བྱང་ཆུབ་ཀྱི་ཤིང་གི་འོད་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ།
en: manifesting various lights from Bodhi trees;

source: སྙིང་པོ་བྱང་ཆུབ་སྣ་ཚོགས་སུ་ཉེ་བར་འདོད་བའི་སྒོ་སྣ་ཚོགས་དང་ལྡན་པ།
en: having various gateways into going toward bodhimaṇḍas;

source: བདུད་ཕམ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་མངོན་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ།
en: manifesting various defeats of Māra ; manifesting various miraculous attainments of buddhahood;

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཚུལ་དང་། མྱིང་དང་ངེས་པའི་ཚིག་སྣ་ཚོགས་དང་ལྡན་པ།
en: having various ways of turning the Dharma wheel, of terms, and of definitions;

source: མདོ་སྡེའི་ཚུལ་ཤིན་ཏུ་བསྟན་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: teaching various ways of the sūtras;

source: ཚིག་གི་ལམ་དང་སྐད་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པ།
en: teaching with various kinds of speech and voice;

source: འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ།
en: having an array of various assemblies of followers;

source: འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་མཐུ་དང་རྒྱན་སྣ་ཚོགས་རབ་ཏུ་འགྱེད་པ།
en: radiating the various displays and powers of their halos of light;

source: ཚེའི་ཚད་སྣ་ཚོགས་དང་ལྡན་པ།
en: having various lifespans;

source: བསྟན་པའི་བྱིན་གྱི་རླབས་སྣ་ཚོགས་དང་ལྡན་པ།
en: having various blessings from their teachings;

source: བསྟན་པ་རྣམ་པར་དམྱིགས་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: their teachings having various objectives;

source: མྱིང་སྣ་ཚོགས་དང་ལྡན་པ།
en: having various names;

source: སྙིང་རྗེ་ཆེན་པོའི་ལུས་སུ་གྱུར་པ་ཤ་སྟག་ཏུ་འགྱུར་ཏེ།
en: and all having bodies of great compassion.

source: དེ་དག་གི་བསྐལ་པའི་དང་པོ་ལ་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོ་མངའ་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་འོད་དུ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: “The first in that kalpa will be a tathāgata by the name of Mahākāruṇika, who will attain the highest, complete enlightenment of buddhahood in a world realm called Ratnaprabhā

source: །དེའི་རྗེས་ལ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་གཉིས་པ་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པའི་སྨོན་ལམ་བཟླ་བ་ཞེས་བྱ་བ་འབྱུང་ངོ་།
en: After him, in that same world, there will be the second tathāgata called Sarva­jagad­dhita­praṇidhāna­candra.

source: །དེ་བཞིན་གཤེགས་པ་གསུམ་པ་ཐུགས་རྗེ་ཆེན་པོའི་སེང་གེ་ཞེས་བྱ་བ་འབྱུང་ངོ་།
en: The third tathāgata will be called Mahā­karuṇā­siṃha.

source: །དེ་བཞིན་གཤེགས་པ་བཞི་པ་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པར་མཛད་པ་ཞེས་བྱ་བ་འབྱུང་བ་ནས།
en: The fourth tathāgata will be called Sarva­loka­hitaiṣin.

source: ཐམས་ཅད་ཀྱི་ཐ་མ་དེ་བཞིན་གཤེགས་པ་སྨན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: The last of them all will be a tathāgata called Vaidyarāja.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། །དེའི་ཚེ་དེའི་དུས་ན་གཡོན་དང་ལྡན་པའི་མིའི་རྒྱལ་པོ་ལ་སྙིང་རིང་བར་གྱུར་ཏེ། ཁོ་མོས་གསོད་མ་མྱིའི་ལག་ཏུ་ཕྱིན་པ་ལས་རང་གི་ལུས་དང་སྲོག་ཡོངས་སུ་བཏང་སྟེ། བཙོན་ར་དེ་དག་ནས་བཀྱེ་བ་དེ་རྣམས་གཞན་དག་ཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: “Noble one, as for the men who were criminals at that time, in that time, who had committed offenses against the king, and whom I freed from imprisonment by going to the executioners and giving up my life and body, if you think that they were anyone else, do not see them in that way.

source: དེ་ལྟར་མྱི་བལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལོག་པར་དད་སེལ་ལ་སྩོགས་པ་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། དེ་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མྱེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དག་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྟོབས་མཐའ་ཡས་གྲགས་པར་བརྗོད་པའི་དཔལ་ཡང་དག་པར་འབྱུང་བའི་བློ་གྲོས་མཐོང་བར་གྱུར་མ་ཐག་ཏུ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ད་ལྟར་ཕྱོགས་བཅུ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཡང་སྒོམ་ཞིང་ཤིན་ཏུ་རྒྱས་པར་བྱེད་པ་དག་གོ །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: They were the tathāgatas of the Bhadra kalpa, beginning with Krakucchanda, and also countless millions of bodhisattvas, who upon seeing the Bhagavat, the Tathāgata Ananta­bala­vighuṣṭa­nirnādita­śrī­saṃbhava­mati, developed the aspiration for the highest, complete enlightenment and are now practicing bodhisattva conduct in the ten directions and meditating and increasing this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings . “Noble one, what do you think?

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that King Jayaprabha at that time, in that time, was anyone else, do not see him in that way.

source: སྨྲ་བ་ཆེན་པོ་བདེན་པ་ཅན་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: The great teacher Satyaka was at that time, in that time, King Jayaprabha.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་འཁོར་དུ་གྱུར་པ་བཙུན་མོའི་འཁོར་དང་། བཙུན་མོའི་གནས་ཀྱི་སྒོ་བའམ། འཁོར་ན་གནས་པའམ། རྗེས་སུ་འཆའ་བ་དེ་དག་ཀྱང་གཞན་དག་ཅིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that King Jayaprabha’s retinue of queens in the harem, the sentinels at the harem entrance, and his court and attendants at that time, in that time, were anyone else, do not see them in that way.

source: ཞགས་པ་འཐུབ་པ་སྟོང་ཕྲག་དྲུག་ཅུ་པོ་སྨྲ་བ་ཆེན་པོ་བདེན་པ་ཅན་གྱིས་སྨྲ་བའི་རྒྱལ་མཚན་ཡོངས་སུ་གཟུང་བའི་དོན་དུ་བཅོམ་ལྡན་འདས་ལ་རྒོལ་དུ་འགྲོ་བའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བླགས་ནས་ཀུན་ཀྱང་ཞིང་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་། བསྐལ་བ་སྣ་ཚོགས་དང་། མྱིང་སྣ་ཚོགས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དག་གོ །རིགས་ཀྱི་བུ་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་དེ་ཕ་དང་མས་གནང་ནས།
en: They were these six thousand Jains whom Satyaka brought before the Bhagavat, who came to debate against the Bhagavat so as to possess the victory banner of teaching, and when they came, the Bhagavat prophesied their attainment of the highest, complete enlightenment, telling them that they would come into a world as tathāgatas with the arrays of various realms, in various kalpas, and with various names.

source: སེམས་ཅན་བཙོན་ར་བ་དེ་དག་ཡོངས་སུ་བཀྲོལ་བའི་འོག་ཏུ་སྲིད་ཤིན་ཏུ་བདེ་བ་དང་། ནོར་དང་དབྱིག་རིན་པོ་ཆེ་ཕུན་སུམ་ཚོགས་པ་དག་ཀྱང་བོར། བུ་དང་ཆུང་མ་དག་ཀྱང་སྤངས་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོའི་ཞམ་རིང་དུ་རབ་ཏུ་བྱུང་ངོ་།
en: “Noble one, Prince Vijitāvin’s father and mother gave him permission, so that after he freed those beings from prison, he cast aside the pleasure of existence, the good fortune of wealth and precious treasuries, abandoned children and wives, and entered mendicancy under the Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja.

source: །རབ་ཏུ་བྱུང་ནས་ཀྱང་ལོ་སྟོང་ཕྲག་ལྔར་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ།
en: After entering mendicancy he maintained celibacy for five thousand years.
